seeul8er/RepPanel_ESP32/main/reppanel_request.c
//
// Copyright (c) 2020 Wolfgang Christl
// Licensed under Apache License, Version 2.0 - https://opensource.org/licenses/Apache-2.0

#include <lvgl/src/lv_misc/lv_task.h>
#include <esp_log.h>
#include <lwip/ip4_addr.h>
#include <esp_http_client.h>
#include <cJSON.h>
#include <lvgl/lvgl.h>
#include "duet_status_json.h"
#include "reppanel.h"
#include "reppanel_request.h"
#include "reppanel_process.h"
#include "reppanel_jobstatus.h"
#include "main.h"
#include "reppanel_macros.h"
#include "reppanel_jobselect.h"
#include "reppanel_console.h"
#include "reppanel_machine.h"
#include "esp32_uart.h"
#include "esp32_wifi.h"

#define TAG                 "RequestTask"
#define REQUEST_TIMEOUT_MS  150

file_tree_elem_t reprap_dir_elem[MAX_NUM_ELEM_DIR];    // put it to the external PSRAM

char rep_addr_resolved[256];

static bool got_filaments = false;
static bool got_extended_status = false;
static bool got_duet_settings = false;
static bool duet_request_macros = false;
static bool duet_request_jobs = false;
static bool duet_request_reply = false;
static int status_request_err_cnt = 0;      // request errors in a row
bool job_paused = false;
int seq_num_msgbox = 0;
int last_status_seq = -1;

static bool uart_request_file_info = false;
static char request_file_path[512];

const char *decode_reprap_status(const char *valuestring) {
    job_paused = false;
    switch (*valuestring) {
        case REPRAP_STATUS_PROCESS_CONFIG:
            job_running = false;
            return "Reading config";
        case REPRAP_STATUS_IDLE:
            job_running = false;
            return "Idle";
        case REPRAP_STATUS_BUSY:
            job_running = false;
            return "Busy";
        case REPRAP_STATUS_PRINTING:
            job_running = true;
            return "Printing";
        case REPRAP_STATUS_DECELERATING:
            job_running = false;
            return "Decelerating";
        case REPRAP_STATUS_STOPPED:
            job_running = true;
            job_paused = true;
            return "Paused";
        case REPRAP_STATUS_RESUMING:
            job_running = true;
            return "Resuming";
        case REPRAP_STATUS_HALTED:
            job_running = false;
            return "Halted";
        case REPRAP_STATUS_FLASHING:
            job_running = false;
            return "Flashing";
        case REPRAP_STATUS_CHANGINGTOOL:
            job_running = true;
            return "Tool change";
        case REPRAP_STATUS_SIMULATING:
            job_running = true;
            return "Simulating";
        case REPRAP_STATUS_OFF:
            job_running = false;
            return "Off";
        default:
            break;
    }
    return "UnknownStatus";
}

void process_reprap_status(char *buff) {
    cJSON *root = cJSON_Parse(buff);
    if (root == NULL) {
        const char *error_ptr = cJSON_GetErrorPtr();
        if (error_ptr != NULL) {
            ESP_LOGE(TAG, "Error before: %s", error_ptr);
        }
        cJSON_Delete(root);
        return;
    }
    cJSON *name = cJSON_GetObjectItem(root, DUET_STATUS);
    if (cJSON_IsString(name) && (name->valuestring != NULL)) {
        strlcpy(reppanel_status, decode_reprap_status(name->valuestring), MAX_REPRAP_STATUS_LEN);
    }

    cJSON *coords = cJSON_GetObjectItem(root, "coords");
    if (coords) {
        cJSON *axesHomed = cJSON_GetObjectItem(coords, "axesHomed");
        if (axesHomed && cJSON_IsArray(axesHomed)) {
            reprap_axes.x_homed = cJSON_GetArrayItem(axesHomed, 0)->valueint == 1;
            reprap_axes.y_homed = cJSON_GetArrayItem(axesHomed, 1)->valueint == 1;
            reprap_axes.z_homed = cJSON_GetArrayItem(axesHomed, 2)->valueint == 1;
        }
        cJSON *xyz = cJSON_GetObjectItem(coords, "xyz");
        if (xyz && cJSON_IsArray(xyz)) {
            reprap_axes.x = cJSON_GetArrayItem(xyz, 0)->valuedouble;
            reprap_axes.y = cJSON_GetArrayItem(xyz, 1)->valuedouble;
            reprap_axes.z = cJSON_GetArrayItem(xyz, 2)->valuedouble;
        }
    }

    cJSON *params = cJSON_GetObjectItem(root, "params");
    if (params) {
        cJSON *atxPower = cJSON_GetObjectItem(params, "atxPower");
        if (atxPower && cJSON_IsNumber(atxPower)) {
            reprap_params.power = atxPower->valueint == 1;
        }
        cJSON *fanPercent = cJSON_GetObjectItem(params, "fanPercent");
        if (fanPercent && cJSON_IsArray(fanPercent)) {
            reprap_params.fan = cJSON_GetArrayItem(fanPercent, 0)->valueint;
        }        
    }    

    int _heater_states[MAX_NUM_TOOLS];  // bed heater state must be on pos 0
    cJSON *duet_temps = cJSON_GetObjectItem(root, DUET_TEMPS);
    if (duet_temps) {
        cJSON *duet_temps_bed = cJSON_GetObjectItem(duet_temps, DUET_TEMPS_BED);
        if (duet_temps_bed) {
            if (reprap_bed.temp_hist_curr_pos < (NUM_TEMPS_BUFF - 1)) {
                reprap_bed.temp_hist_curr_pos++;
            } else {
                reprap_bed.temp_hist_curr_pos = 0;
            }
            reprap_bed.temp_buff[reprap_bed.temp_hist_curr_pos] = cJSON_GetObjectItem(duet_temps_bed,
                                                                                      DUET_TEMPS_BED_CURRENT)->valuedouble;
        }
        // Get bed heater index
        cJSON *duet_temps_bed_heater = cJSON_GetObjectItem(duet_temps_bed,
                                                           DUET_TEMPS_BED_HEATER);    // bed heater state
        if (duet_temps_bed_heater && cJSON_IsNumber(duet_temps_bed_heater)) {
            reprap_bed.heater_indx = duet_temps_bed_heater->valueint;
        }
        // Get bed active temp
        cJSON *duet_temps_bed_active = cJSON_GetObjectItem(duet_temps_bed, DUET_TEMPS_ACTIVE);    // bed active temp
        if (duet_temps_bed_active && cJSON_IsNumber(duet_temps_bed_active)) {
            reprap_bed.active_temp = duet_temps_bed_active->valuedouble;
        }
        // Get bed standby temp
        cJSON *duet_temps_bed_standby = cJSON_GetObjectItem(duet_temps_bed, DUET_TEMPS_STANDBY);    // bed active temp
        if (duet_temps_bed_standby && cJSON_IsNumber(duet_temps_bed_standby)) {
            reprap_bed.standby_temp = duet_temps_bed_standby->valuedouble;
        }
        // Get bed heater state
        cJSON *duet_temps_bed_state = cJSON_GetObjectItem(duet_temps_bed, DUET_TEMPS_BED_STATE);    // bed heater state
        if (duet_temps_bed_state && cJSON_IsNumber(duet_temps_bed_state)) {
            _heater_states[0] = duet_temps_bed_state->valueint;
        }
    }

