seeul8er/RepPanel_ESP32/main/reppanel_request.c
    bool disp_msg = false;      // Message without title
    bool disp_msgbox = false;   // Message box with title
    bool disp_h_msgbox = false; // height adjust dialog
    static char msg_title[384];
    static char msg_msg[384];
    static char msg_txt[384];
    cJSON *duet_seq = cJSON_GetObjectItem(root, "seq");
    cJSON *duet_output = cJSON_GetObjectItem(root, "output");
    if (duet_output) {
        cJSON *duet_output_msg = cJSON_GetObjectItem(duet_output, "message");
        if (duet_output_msg && cJSON_IsString(duet_output_msg) && duet_seq && duet_seq->valueint != last_status_seq) {
            disp_msg = true;
            strncpy(msg_txt, duet_output_msg->valuestring, 384);
        }
        // Right now we only have a msg box for manual bed calibration
        cJSON *duet_output_msgbox = cJSON_GetObjectItem(duet_output, "msgBox");
        if (duet_output_msgbox) {
            cJSON *seq = cJSON_GetObjectItem(duet_output_msgbox, "seq");
            cJSON *title = cJSON_GetObjectItem(duet_output_msgbox, "title");
            cJSON *duet_msg = cJSON_GetObjectItem(duet_output_msgbox, "msg");
            strncpy(msg_title, title->valuestring, 384);
            strncpy(msg_msg, duet_msg->valuestring, 384);
            // Beware. This is dirty. Check if we want to show this msg box. We might already display it
            if (seq->valueint != seq_num_msgbox) {
                seq_num_msgbox = seq->valueint;
                if (strcmp(duet_msg->valuestring,
                           "Adjust height until the nozzle just touches the bed, then press OK") == 0)
                    disp_h_msgbox = true;
                else
                    disp_msgbox = true;
            }
        }
    }

    if (duet_seq && cJSON_IsNumber(duet_seq)) {
        if (duet_seq->valueint != last_status_seq) {
            duet_request_reply = true;
            ESP_LOGI(TAG, "Need reply!");
            // When connected via UART the reply is already part of the msg
            cJSON *duet_resp = cJSON_GetObjectItem(root, "resp");
            if (duet_resp && strlen(duet_resp->valuestring) > 0 && duet_resp->valuestring[0] != '\n') {      // sometimes it's just a new line char
                ESP_LOGI(TAG, "Length MSG: %i - %s", strlen(duet_resp->valuestring), duet_resp->valuestring);
                disp_msg = true;
                strncpy(msg_txt, duet_resp->valuestring, 384);
            }
        }
        last_status_seq = duet_seq->valueint;
    }

    // Get tool heater state
    cJSON *duet_temps_state = cJSON_GetObjectItem(duet_temps, DUET_TEMPS_BED_STATE);        // all other heater states
    int pos = 0;
    cJSON *iterator = NULL;
    cJSON_ArrayForEach(iterator, duet_temps_state) {
        if (cJSON_IsNumber(iterator)) {
            if (pos != reprap_bed.heater_indx) {                                            // ignore bed heater
                _heater_states[pos] = iterator->valueint;
            }
            pos++;
        }
    }
    num_heaters = pos;

    // Get tool information
    pos = 0;
    cJSON *tools = cJSON_GetObjectItem(root, DUET_TOOLS);
    if (tools != NULL) {
        cJSON_ArrayForEach(iterator, tools) {
            if (cJSON_IsObject(iterator)) {
                if (cJSON_IsNumber(cJSON_GetObjectItem(iterator, "number")))
                    reprap_tools[pos].number = cJSON_GetObjectItem(iterator, "number")->valueint;
                if (cJSON_IsString(cJSON_GetObjectItem(iterator, "name")))
                    strncpy(reprap_tools[pos].name, cJSON_GetObjectItem(iterator, "name")->valuestring,
                            MAX_TOOL_NAME_LEN);
                if (cJSON_IsString(cJSON_GetObjectItem(iterator, "filament")))
                    strncpy(reprap_tools[pos].filament, cJSON_GetObjectItem(iterator, "filament")->valuestring,
                            MAX_FILA_NAME_LEN);
                reprap_tools[pos].heater_indx = pos + 1;    // set to some default value
                if (cJSON_IsArray(cJSON_GetObjectItem(iterator, "heaters"))) {
                    // Ignore multiple heaters per tool
                    cJSON *heaterindx_item = cJSON_GetArrayItem(cJSON_GetObjectItem(iterator, "heaters"), 0);
                    reprap_tools[pos].heater_indx = heaterindx_item->valueint;
                }
                pos++;
            }
        }
        got_extended_status = true;
        num_tools = pos;    // update number of tools
    }

    // Get firmware information
    cJSON *mcutemp = cJSON_GetObjectItem(root, DUET_MCU_TEMP);
    if (mcutemp)
        reprap_mcu_temp = cJSON_GetObjectItem(mcutemp, "cur")->valuedouble;
    cJSON *firmware_name = cJSON_GetObjectItem(root, DUET_FIRM_NAME);
    if (firmware_name)
        strncpy(reprap_firmware_name, firmware_name->valuestring, sizeof(reprap_firmware_name));
    cJSON *firmware_version = cJSON_GetObjectItem(root, DUET_FIRM_VER);
    if (firmware_version)
        strncpy(reprap_firmware_version, firmware_version->valuestring, sizeof(reprap_firmware_version));

    // Get current tool temperatures
    cJSON *duet_temps_current = cJSON_GetObjectItem(duet_temps, DUET_TEMPS_CURRENT);
    if (duet_temps_current) {
        for (int i = 0; i < num_tools; i++) {
            if (reprap_tools[i].temp_hist_curr_pos < (NUM_TEMPS_BUFF - 1)) {
                reprap_tools[i].temp_hist_curr_pos++;
            } else {
                reprap_tools[i].temp_hist_curr_pos = 0;
            }
            reprap_tools[i].temp_buff[reprap_tools[i].temp_hist_curr_pos] = cJSON_GetArrayItem(duet_temps_current,
                                                                                               reprap_tools[i].heater_indx)->valuedouble;
        }
    }
    // Get active & standby tool temperatures. As for now there is only support one heater per tool
    cJSON *duet_temps_tools = cJSON_GetObjectItem(duet_temps, DUET_TEMPS_TOOLS);
    cJSON *duet_temps_tools_active = cJSON_GetObjectItem(duet_temps_tools, DUET_TEMPS_ACTIVE);
    cJSON *duet_temps_tools_standby = cJSON_GetObjectItem(duet_temps_tools, DUET_TEMPS_STANDBY);
    if (duet_temps_tools_active && cJSON_IsArray(duet_temps_tools_active) && duet_temps_tools_standby &&
        cJSON_IsArray(duet_temps_tools_standby)) {
        for (int i = 0; i < num_tools; i++) {
            cJSON *tool_active_temps_arr = cJSON_GetArrayItem(duet_temps_tools_active,
                                                              reprap_tools[i].number);
            cJSON *tool_standby_temps_arr = cJSON_GetArrayItem(duet_temps_tools_standby,
                                                               reprap_tools[i].number);
            if (tool_active_temps_arr) {
                reprap_tools[i].active_temp = cJSON_GetArrayItem(tool_active_temps_arr,0)->valuedouble; }
            if (tool_standby_temps_arr) {
                reprap_tools[i].standby_temp = cJSON_GetArrayItem(tool_standby_temps_arr,0)->valuedouble; }
        }
    }
    // print job status
    bool got_printjob_status = false;
    cJSON *print_progess = cJSON_GetObjectItem(root, REPRAP_FRAC_PRINTED);
    if (print_progess && cJSON_IsNumber(print_progess)) {
        got_printjob_status = true;
        reprap_job_percent = print_progess->valuedouble;
    }

    cJSON *job_dur = cJSON_GetObjectItem(root, REPRAP_JOB_DUR);
    if (job_dur && cJSON_IsNumber(job_dur)) {
        reprap_job_duration = job_dur->valuedouble;
    }

    cJSON *job_curr_layer = cJSON_GetObjectItem(root, REPRAP_CURR_LAYER);
    if (job_curr_layer && cJSON_IsNumber(job_curr_layer)) {
        reprap_job_curr_layer = job_curr_layer->valueint;
    }

    // update UI
    if (xGuiSemaphore != NULL && xSemaphoreTake(xGuiSemaphore, (TickType_t) 100) == pdTRUE) {
        if (label_status != NULL) lv_label_set_text(label_status, reppanel_status);
        update_ui_machine();
        update_bed_temps_ui();  // update UI with new values
        update_heater_status_ui(_heater_states, num_heaters);  // update UI with new values
        update_current_tool_temps_ui();     // update UI with new values
        if (got_extended_status && label_extruder_name != NULL) {
            lv_label_set_text(label_extruder_name, reprap_tools[current_visible_tool_indx].name);
        }
        if (got_printjob_status) update_print_job_status_ui();
        if (disp_msg) reppanel_disp_msg(msg_txt);
        if (disp_h_msgbox) show_height_adjust_dialog();
        if (disp_msgbox) duet_show_dialog(msg_title, msg_msg);
        update_rep_panel_conn_status();
        xSemaphoreGive(xGuiSemaphore);
    }

