seeul8er/RepPanel_ESP32/main/reppanel_request.c
    cJSON_Delete(root);
}

void process_reprap_settings(char *buff) {
    ESP_LOGI(TAG, "Processing D2WC status json");
    cJSON *root = cJSON_Parse(buff);
    if (root == NULL) {
        const char *error_ptr = cJSON_GetErrorPtr();
        if (error_ptr != NULL) {
            ESP_LOGE(TAG, "Error before: %s", error_ptr);
        }
        cJSON_Delete(root);
        return;
    }
    cJSON *machine = cJSON_GetObjectItem(root, "machine");
    reprap_babysteps_amount = cJSON_GetObjectItem(machine, "babystepAmount")->valuedouble;
    reprap_move_feedrate = cJSON_GetObjectItem(machine, "moveFeedrate")->valuedouble;
    cJSON *machine_extruder_amounts = cJSON_GetObjectItem(machine, "extruderAmounts");
    cJSON *machine_extruder_feedrates = cJSON_GetObjectItem(machine, "extruderFeedrates");

    cJSON *machine_temps = cJSON_GetObjectItem(machine, "temperatures");
    cJSON *machine_temps_tool = cJSON_GetObjectItem(machine_temps, "tool");
    cJSON *machine_temps_tool_active = cJSON_GetObjectItem(machine_temps_tool, "active");
    cJSON *machine_temps_tool_standby = cJSON_GetObjectItem(machine_temps_tool, "standby");

    cJSON *machine_temps_bed = cJSON_GetObjectItem(machine_temps, "bed");
    cJSON *machine_temps_bed_active = cJSON_GetObjectItem(machine_temps_bed, "active");
    cJSON *machine_temps_bed_standby = cJSON_GetObjectItem(machine_temps_bed, "standby");

    cJSON *iterator = NULL;
    int pos = 0;
    cJSON_ArrayForEach(iterator, machine_extruder_amounts) {
        if (cJSON_IsNumber(iterator)) {
            reprap_extruder_amounts[pos] = iterator->valuedouble;
            pos++;
        }
    }
    pos = 0;
    cJSON_ArrayForEach(iterator, machine_extruder_feedrates) {
        if (cJSON_IsNumber(iterator)) {
            reprap_extruder_feedrates[pos] = iterator->valuedouble;
            pos++;
        }
    }

    pos = 0;
    cJSON_ArrayForEach(iterator, machine_temps_tool_active) {
        if (cJSON_IsNumber(iterator)) {
            reprap_tool_poss_temps.temps_active[pos] = iterator->valuedouble;
            pos++;
        }
    }

    pos = 0;
    cJSON_ArrayForEach(iterator, machine_temps_tool_standby) {
        if (cJSON_IsNumber(iterator)) {
            reprap_tool_poss_temps.temps_standby[pos] = iterator->valuedouble;
            pos++;
        }
    }

    pos = 0;
    cJSON_ArrayForEach(iterator, machine_temps_bed_standby) {
        if (cJSON_IsNumber(iterator)) {
            reprap_bed_poss_temps.temps_standby[pos] = iterator->valuedouble;
            pos++;
        }
    }

    pos = 0;
    cJSON_ArrayForEach(iterator, machine_temps_bed_active) {
        if (cJSON_IsNumber(iterator)) {
            reprap_bed_poss_temps.temps_active[pos] = iterator->valuedouble;
            pos++;
        }
    }
    ESP_LOGI(TAG, "Got D2WC status json");
    got_duet_settings = true;
    cJSON_Delete(root);
}

void process_reprap_filelist(char *buffer) {
    cJSON *root = cJSON_Parse(buffer);
    if (root == NULL) {
        const char *error_ptr = cJSON_GetErrorPtr();
        if (error_ptr != NULL) {
            ESP_LOGE(TAG, "Error before: %s", error_ptr);
        }
        cJSON_Delete(root);
        return;
    }
    cJSON *err_resp = cJSON_GetObjectItem(root, "err");
    if (err_resp) {
        ESP_LOGE(TAG, "reprap_filelist - Duet responded with error code %i", err_resp->valueint);
        ESP_LOGE(TAG, "%s", cJSON_Print(root));
        cJSON_Delete(root);
        return;
    }
    cJSON *next = cJSON_GetObjectItem(root, "next");
    if (next != NULL && next->valueint != 0) {
        // TODO: Not only get first list. Get all items. Check for next item
    }
    cJSON *dir_name = cJSON_GetObjectItem(root, "dir");
    if (dir_name && strncmp("0:/filaments", dir_name->valuestring, 12) == 0) {
        ESP_LOGI(TAG, "Processing filament names");
        got_filaments = true;

        cJSON *filament_folders = cJSON_GetObjectItem(root, "files");
        if (filament_folders) {
            cJSON *iterator = NULL;
            int pos = 0;
            filament_names[0] = '\0';
            cJSON_ArrayForEach(iterator, filament_folders) {
                if (cJSON_IsObject(iterator)) {
                    if (strncmp("d", cJSON_GetObjectItem(iterator, "type")->valuestring, 1) == 0) {
                        if (pos != 0) strncat(filament_names, "\n", MAX_LEN_STR_FILAMENT_LIST - strlen(filament_names));
                        strncat(filament_names, cJSON_GetObjectItem(iterator, "name")->valuestring,
                                MAX_LEN_STR_FILAMENT_LIST - strlen(filament_names));
                        pos++;
                    }
                }
            }
            ESP_LOGI(TAG, "Filament names\n%s", filament_names);
        } else {
            filament_names[0] = '\0';
        }
    } else if (dir_name && strncmp("0:/macros", dir_name->valuestring, 9) == 0) {
        ESP_LOGI(TAG, "Processing macros");
        for (int i = 0; i < MAX_NUM_ELEM_DIR; i++) {
            reprap_dir_elem[i].type = TREE_EMPTY_ELEM;
        }
        cJSON *_folders = cJSON_GetObjectItem(root, "files");
        if (_folders) {
            cJSON *iterator = NULL;
            int pos = 0;
            cJSON_ArrayForEach(iterator, _folders) {
                if (cJSON_IsObject(iterator)) {
                    if (pos < MAX_NUM_ELEM_DIR) {
                        strncpy(reprap_dir_elem[pos].name, cJSON_GetObjectItem(iterator, "name")->valuestring,
                                MAX_LEN_FILENAME - 1);
                        strncpy(reprap_dir_elem[pos].dir, dir_name->valuestring, MAX_LEN_DIRNAME - 1);
                        reprap_dir_elem[pos].time_stamp = datestr_2unix(cJSON_GetObjectItem(iterator, "date")->valuestring);
                        if (strncmp("f", cJSON_GetObjectItem(iterator, "type")->valuestring, 1) == 0) {
                            reprap_dir_elem[pos].type = TREE_FILE_ELEM;
                        } else {
                            reprap_dir_elem[pos].type = TREE_FOLDER_ELEM;
                        }
                        pos++;
                    }
                }
            }
        }
        if (xGuiSemaphore != NULL && xSemaphoreTake(xGuiSemaphore, (TickType_t) 100) == pdTRUE) {
            update_macro_list_ui();
            xSemaphoreGive(xGuiSemaphore);
        }
    } else if (dir_name && strncmp("0:/gcodes", dir_name->valuestring, 9) == 0) {
        ESP_LOGI(TAG, "Processing jobs");
        cJSON *iterator = NULL;
        for (int i = 0; i < MAX_NUM_ELEM_DIR; i++) {  // clear array
            reprap_dir_elem[i].type = TREE_EMPTY_ELEM;
        }
        int pos = 0;
        cJSON *_folders = cJSON_GetObjectItem(root, "files");
        if (_folders) {
            cJSON_ArrayForEach(iterator, _folders) {
                if (cJSON_IsObject(iterator)) {
                    if (pos < MAX_NUM_ELEM_DIR) {
                        strncpy(reprap_dir_elem[pos].name, cJSON_GetObjectItem(iterator, "name")->valuestring,
                                MAX_LEN_FILENAME - 1);
                        strncpy(reprap_dir_elem[pos].dir, dir_name->valuestring, MAX_LEN_DIRNAME - 1);
                        reprap_dir_elem[pos].time_stamp = datestr_2unix(cJSON_GetObjectItem(iterator, "date")->valuestring);
                        if (strncmp("f", cJSON_GetObjectItem(iterator, "type")->valuestring, 1) == 0) {
                            reprap_dir_elem[pos].type = TREE_FILE_ELEM;
                        } else {
                            reprap_dir_elem[pos].type = TREE_FOLDER_ELEM;
                        }
                        pos++;
                    }
                }
            }
        }
        if (xGuiSemaphore != NULL && xSemaphoreTake(xGuiSemaphore, (TickType_t) 100) == pdTRUE) {
            update_job_list_ui();
            xSemaphoreGive(xGuiSemaphore);
        }
    }
    cJSON_Delete(root);
}

