seeul8er/RepPanel_ESP32/main/reppanel_request.c
void process_reprap_fileinfo(char *data_buff) {
    cJSON *root = cJSON_Parse(data_buff);
    if (root == NULL) {
        const char *error_ptr = cJSON_GetErrorPtr();
        if (error_ptr != NULL) {
            ESP_LOGE(TAG, "Got %s", data_buff);
            ESP_LOGE(TAG, "Error before: %s", error_ptr);
        }
        cJSON_Delete(root);
        return;
    }
    cJSON *err_resp = cJSON_GetObjectItem(root, DUET_ERR);
    if (err_resp && err_resp->valueint != 0) {     // maybe no active print
        cJSON_Delete(root);
        return;
    }
    cJSON *job_time_sim = cJSON_GetObjectItem(root, REPRAP_SIMTIME);
    if (job_time_sim && cJSON_IsNumber(job_time_sim)) {
        reprap_job_time_sim = job_time_sim->valueint;
    } else {
        reprap_job_time_sim = -1;
    }

    cJSON *job_print_time = cJSON_GetObjectItem(root, REPRAP_PRINTTIME);
    if (job_print_time && cJSON_IsNumber(job_print_time)) {
        reprap_job_time_file = job_print_time->valueint;
    }

    cJSON *job_name = cJSON_GetObjectItem(root, "fileName");
    if (job_name && cJSON_IsString(job_name)) {
        strncpy(current_job_name, &job_name->valuestring[10], MAX_LEN_FILENAME);
    }

    cJSON *job_height = cJSON_GetObjectItem(root, "height");
    if (job_height && cJSON_IsNumber(job_height)) {
        reprap_job_height = job_height->valuedouble;
    }
    cJSON *job_first_layer_height = cJSON_GetObjectItem(root, "firstLayerHeight");
    if (job_first_layer_height && cJSON_IsNumber(job_first_layer_height)) {
        reprap_job_first_layer_height = job_first_layer_height->valuedouble;
    }
    cJSON *job_layer_height = cJSON_GetObjectItem(root, "layerHeight");
    if (job_layer_height && cJSON_IsNumber(job_layer_height)) {
        reprap_job_layer_height = job_layer_height->valuedouble;
    }
    cJSON_Delete(root);
}

void process_reprap_reply(wifi_response_buff_t *response_buffer) {
    duet_request_reply = false;
    if (response_buffer->buf_pos > 1) {
        if (xGuiSemaphore != NULL && xSemaphoreTake(xGuiSemaphore, (TickType_t) 10) == pdTRUE) {
            duet_show_dialog("Response to G-Code", response_buffer->buffer);
            xSemaphoreGive(xGuiSemaphore);
        }
    }
}

void reprap_uart_send_gcode(char *gcode) {
    reppanel_write_uart(gcode, strlen(gcode));
    ESP_LOGD(TAG, "Sent %s", gcode);
}

void reprap_uart_get_status(uart_response_buff_t *receive_buff, int type) {
    ESP_LOGI(TAG, "Getting status (UART) %i", type);
    char buff[8];
    sprintf(buff, "M408 S%i", type);
    reprap_uart_send_gcode(buff);
    if (reppanel_read_response(receive_buff)) {
        process_reprap_status((char *) receive_buff->buffer);
    }
}

void reprap_uart_get_file_info(uart_response_buff_t *receive_buff) {
    char buff[524];
    sprintf(buff, "M36 \"%s\"", request_file_path);
    reprap_uart_send_gcode(buff);
    if (reppanel_read_response(receive_buff)) {
        process_reprap_fileinfo((char *) receive_buff->buffer);
        uart_request_file_info = false;
    }
}

void reprap_uart_get_filelist(uart_response_buff_t *receive_buff, char *path) {
    char buff[512];
    sprintf(buff, "M20 S3 P\"%s\"", path);
    reprap_uart_send_gcode(buff);
    if (reppanel_read_response(receive_buff)) {
        process_reprap_filelist((char *) receive_buff->buffer);
    }
}

/**
 * Fill internals with dummy values since we can not download files using UART ?!
 */
void reprap_uart_download(uart_response_buff_t *receive_buff, char *path) {
    ESP_LOGI(TAG, "Setting hardcoded values for bed/tool temperatures");
    // max len NUM_TEMPS_BUFF, last must be <0
    static double bed_temps_hardcoded[] = {0, 30, 40, 60, 63, 70, 80, 90, 100, 105, 110, -1};
    static double tool_temps_hardcoded[] = {0, 160, 180, 190, 200, 210, 230, 240, 250, 260, 270, 280, -1};
    memcpy(reprap_bed_poss_temps.temps_standby, bed_temps_hardcoded, sizeof(bed_temps_hardcoded));
    memcpy(reprap_bed_poss_temps.temps_active, bed_temps_hardcoded, sizeof(bed_temps_hardcoded));
    memcpy(reprap_tool_poss_temps.temps_standby, tool_temps_hardcoded, sizeof(tool_temps_hardcoded));
    memcpy(reprap_tool_poss_temps.temps_active, tool_temps_hardcoded, sizeof(tool_temps_hardcoded));
    got_duet_settings = true;
}

esp_err_t http_event_handle(esp_http_client_event_t *evt) {
    if (esp_http_client_get_status_code(evt->client) == 401) {
        ESP_LOGW(TAG, "Need to authorise first. Ignoring data.");
        return ESP_OK;
    }
    wifi_response_buff_t *resp_buff = (wifi_response_buff_t *) evt->user_data;
    switch (evt->event_id) {
        case HTTP_EVENT_ERROR:
            ESP_LOGI(TAG, "Event handler detected http error");
            break;
        case HTTP_EVENT_ON_CONNECTED:
            resp_buff->buf_pos = 0;
            break;
        case HTTP_EVENT_HEADER_SENT:
        case HTTP_EVENT_ON_HEADER:
            break;
        case HTTP_EVENT_ON_DATA:
            if (!esp_http_client_is_chunked_response(evt->client)) {
                if ((resp_buff->buf_pos + evt->data_len) < JSON_BUFF_SIZE) {
                    strncpy(&resp_buff->buffer[resp_buff->buf_pos], (char *) evt->data, evt->data_len);
                    resp_buff->buf_pos += evt->data_len;
                } else {
                    ESP_LOGE(TAG, "Status-JSON buffer overflow (%i >= %i). Resetting!",
                             (evt->data_len + resp_buff->buf_pos), JSON_BUFF_SIZE);
                    resp_buff->buf_pos = 0;
                }
            }
            break;
        case HTTP_EVENT_ON_FINISH:
            break;
        case HTTP_EVENT_DISCONNECTED:
            resp_buff->buf_pos = 0;
            break;
    }
    return ESP_OK;
}

void wifi_duet_authorise(wifi_response_buff_t *buffer, bool get_d2wc_config) {
    char printer_url[MAX_REQ_ADDR_LENGTH];
    sprintf(printer_url, "%s/rr_connect?password=%s", rep_addr_resolved, rep_pass);
    esp_http_client_config_t config = {
            .url = printer_url,
            .timeout_ms = REQUEST_TIMEOUT_MS,
            .event_handler = http_event_handle,
            .user_data = buffer
    };
    esp_http_client_handle_t client = esp_http_client_init(&config);
    esp_err_t err = esp_http_client_perform(client);

    if (err == ESP_OK) {
//        ESP_LOGI(TAG, "Status = %d, content_length = %d",
//                 esp_http_client_get_status_code(client),
//                 esp_http_client_get_content_length(client));
    }
    esp_http_client_cleanup(client);
    // if (get_d2wc_config) reprap_wifi_download("0%3A%2Fsys%2Fdwc2settings.json");
}

void reprap_wifi_get_status(wifi_response_buff_t *resp_buff, int type) {
    ESP_LOGI(TAG, "Getting status %i", type);
    char request_addr[MAX_REQ_ADDR_LENGTH];
    sprintf(request_addr, "%s/rr_status?type=%i", rep_addr_resolved, type);
    esp_http_client_config_t config = {
            .url = request_addr,
            .timeout_ms = REQUEST_TIMEOUT_MS,
            .event_handler = http_event_handle,
            .user_data = resp_buff,
    };
    esp_http_client_handle_t client = esp_http_client_init(&config);
    esp_err_t err = esp_http_client_perform(client);

    if (err == ESP_OK) {
        switch (esp_http_client_get_status_code(client)) {
            case 200:
                status_request_err_cnt = 0;
                if (rp_conn_stat != REPPANEL_UART_CONNECTED)
                    rp_conn_stat = REPPANEL_WIFI_CONNECTED;
                process_reprap_status(resp_buff->buffer);
                break;
            case 401:
                ESP_LOGI(TAG, "Authorising with Duet");
                wifi_duet_authorise(resp_buff, true);
                break;
            default:
                break;
        }
    } else {
        ESP_LOGW(TAG, "Error requesting RepRap status: %s", esp_err_to_name(err));
        status_request_err_cnt++;
        if (status_request_err_cnt > 0) {
            if (rp_conn_stat != REPPANEL_UART_CONNECTED)
                rp_conn_stat = REPPANEL_WIFI_CONNECTED_DUET_DISCONNECTED;
            if (xGuiSemaphore != NULL && xSemaphoreTake(xGuiSemaphore, (TickType_t) 10) == pdTRUE) {
                update_rep_panel_conn_status();
                xSemaphoreGive(xGuiSemaphore);
            }
        }
    }
    esp_http_client_cleanup(client);
}

