seeul8er/RepPanel_ESP32/main/reppanel_request.c
void reprap_wifi_get_rreply(wifi_response_buff_t *response_buffer) {
    char request_addr[MAX_REQ_ADDR_LENGTH];
    sprintf(request_addr, "%s/rr_reply", rep_addr_resolved);
    esp_http_client_config_t config = {
            .url = request_addr,
            .timeout_ms = 1000,
            .event_handler = http_event_handle,
            .user_data = response_buffer
    };
    esp_http_client_handle_t client = esp_http_client_init(&config);
    esp_err_t err = esp_http_client_perform(client);

    if (err == ESP_OK) {
        switch (esp_http_client_get_status_code(client)) {
            case 200:
                ESP_LOGI(TAG, "Got reply! %i", response_buffer->buf_pos);
                process_reprap_reply(response_buffer);
                break;
            case 401:
                ESP_LOGI(TAG, "Authorising with Duet");
                wifi_duet_authorise(response_buffer, false);
                break;
            default:
                break;
        }
    } else {
        ESP_LOGW(TAG, "Error getting reply via WiFi: %s", esp_err_to_name(err));
    }
    esp_http_client_cleanup(client);
}

bool reprap_wifi_send_gcode(char *gcode) {
    bool success = false;
    char request_addr[MAX_REQ_ADDR_LENGTH];
    char encoded_gcode[strlen(gcode) * 3];
    url_encode((unsigned char *) gcode, encoded_gcode);
    sprintf(request_addr, "%s/rr_gcode?gcode=%s", rep_addr_resolved, encoded_gcode);
    ESP_LOGV(TAG, "%s", request_addr);
    wifi_response_buff_t resp_buff_gui_task;
    esp_http_client_config_t config = {
            .url = request_addr,
            .timeout_ms = REQUEST_TIMEOUT_MS,
            .event_handler = http_event_handle,
            .user_data = &resp_buff_gui_task
    };
    esp_http_client_handle_t client = esp_http_client_init(&config);
    esp_err_t err = esp_http_client_perform(client);

    if (err == ESP_OK) {
        ESP_LOGI(TAG, "Status = %d, content_length = %d",
                 esp_http_client_get_status_code(client),
                 esp_http_client_get_content_length(client));
        switch (esp_http_client_get_status_code(client)) {
            case 200:
                success = true;
                break;
            case 401:
                ESP_LOGI(TAG, "Authorising with Duet");
                wifi_duet_authorise(&resp_buff_gui_task, false);
                break;
            default:
                break;
        }
    } else {
        ESP_LOGW(TAG, "Error sending GCode via WiFi: %s", esp_err_to_name(err));
        success = false;
    }
    esp_http_client_cleanup(client);
    return success;
}

void reprap_wifi_get_filelist(wifi_response_buff_t *resp_buffer, char *directory) {
    char request_addr[MAX_REQ_ADDR_LENGTH];
    char encoded_dir[strlen(directory) * 3];
    url_encode((unsigned char *) directory, encoded_dir);
    sprintf(request_addr, "%s/rr_filelist?dir=%s", rep_addr_resolved, encoded_dir);
    ESP_LOGI(TAG, "%s", request_addr);
    esp_http_client_config_t config = {
            .url = request_addr,
            .timeout_ms = REQUEST_TIMEOUT_MS,
            .event_handler = http_event_handle,
            .user_data = resp_buffer,
    };
    esp_http_client_handle_t client = esp_http_client_init(&config);
    esp_err_t err = esp_http_client_perform(client);

    if (err == ESP_OK) {
        ESP_LOGI(TAG, "Got file list via WiFi %d",
                 esp_http_client_get_content_length(client));

        switch (esp_http_client_get_status_code(client)) {
            case 200:
                process_reprap_filelist(resp_buffer->buffer);
                break;
            case 401:
                ESP_LOGI(TAG, "Authorising with Duet");
                wifi_duet_authorise(resp_buffer, false);
                break;
            default:
                break;
        }
    } else {
        ESP_LOGW(TAG, "Error getting file list via WiFi: %s", esp_err_to_name(err));
    }
    esp_http_client_cleanup(client);
}

/**
 * Task that gets files list
 * @param params Char array describing path to directory on pritner
 */
void reprap_wifi_get_filelist_task(void *params) {
    char *directory = params;
    char request_addr[MAX_REQ_ADDR_LENGTH];
    char encoded_dir[strlen(directory) * 3];
    url_encode((unsigned char *) directory, encoded_dir);
    sprintf(request_addr, "%s/rr_filelist?dir=%s&first=0", rep_addr_resolved, encoded_dir);
    ESP_LOGD("FileListTask", "Unformatted: %s", directory);
    ESP_LOGD("FileListTask", "Request: %s", request_addr);
    wifi_response_buff_t resp_buff_filelist_task;
    esp_http_client_config_t config = {
            .url = request_addr,
            .timeout_ms = REQUEST_TIMEOUT_MS,
            .event_handler = http_event_handle,
            .user_data = &resp_buff_filelist_task,
    };
    esp_http_client_handle_t client = esp_http_client_init(&config);
    esp_err_t err = esp_http_client_perform(client);

    if (err == ESP_OK) {
        ESP_LOGI(TAG, "Status = %d, content_length = %d",
                 esp_http_client_get_status_code(client),
                 esp_http_client_get_content_length(client));

        switch (esp_http_client_get_status_code(client)) {
            case 200:
                process_reprap_filelist(resp_buff_filelist_task.buffer);
                break;
            case 401:
                ESP_LOGI(TAG, "Authorising with Duet");
                wifi_duet_authorise(&resp_buff_filelist_task, false);
                break;
            default:
                break;
        }
    } else {
        ESP_LOGW(TAG, "Error getting file list via WiFi: %s", esp_err_to_name(err));
    }
    esp_http_client_cleanup(client);
    vTaskDelete(NULL);
}

void reprap_wifi_get_fileinfo(wifi_response_buff_t *resp_data, char *filename) {
    char request_addr[MAX_REQ_ADDR_LENGTH];
    if (filename != NULL) {
        char encoded_filename[strlen(filename) * 3];
        url_encode((unsigned char *) filename, encoded_filename);
        sprintf(request_addr, "%s/rr_fileinfo?dir=%s", rep_addr_resolved, encoded_filename);
    } else {
        sprintf(request_addr, "%s/rr_fileinfo", rep_addr_resolved);
    }
    ESP_LOGI(TAG, "Getting file info %s", request_addr);
    esp_http_client_config_t config = {
            .url = request_addr,
            .timeout_ms = REQUEST_TIMEOUT_MS,
            .event_handler = http_event_handle,
            .user_data = resp_data,
    };
    esp_http_client_handle_t client = esp_http_client_init(&config);
    esp_err_t err = esp_http_client_perform(client);

    if (err == ESP_OK) {
        switch (esp_http_client_get_status_code(client)) {
            case 200:
                process_reprap_fileinfo(resp_data->buffer);
                break;
            case 401:
                ESP_LOGI(TAG, "Authorising with Duet");
                wifi_duet_authorise(resp_data, false);
                break;
            default:
                break;
        }
    } else {
        ESP_LOGW(TAG, "Error getting file info via WiFi: %s", esp_err_to_name(err));
    }
    esp_http_client_cleanup(client);
}

void reprap_wifi_get_config() {
    char request_addr[MAX_REQ_ADDR_LENGTH];
    sprintf(request_addr, "%s/rr_config", rep_addr_resolved);
    wifi_response_buff_t resp_buff_gui_task;
    esp_http_client_config_t config = {
            .url = request_addr,
            .timeout_ms = REQUEST_TIMEOUT_MS,
            .event_handler = http_event_handle,
            .user_data = &resp_buff_gui_task,
    };
    esp_http_client_handle_t client = esp_http_client_init(&config);
    esp_err_t err = esp_http_client_perform(client);

    if (err == ESP_OK) {
        ESP_LOGI(TAG, "Status = %d, content_length = %d",
                 esp_http_client_get_status_code(client),
                 esp_http_client_get_content_length(client));
    }
    switch (esp_http_client_get_status_code(client)) {
        case 200:
            // TODO process_reprap_config();
            break;
        case 401:
            ESP_LOGI(TAG, "Authorising with Duet");
            wifi_duet_authorise(&resp_buff_gui_task, false);
            break;
        default:
            break;
    }
    esp_http_client_cleanup(client);
}


void reprap_wifi_download(wifi_response_buff_t *response_buffer, char *file) {
    ESP_LOGI(TAG, "Downloading %s", file);
    char request_addr[MAX_REQ_ADDR_LENGTH];
    sprintf(request_addr, "%s/rr_download?name=%s", rep_addr_resolved, file);
    esp_http_client_config_t config = {
            .url = request_addr,
            .timeout_ms = REQUEST_TIMEOUT_MS,
            .event_handler = http_event_handle,
            .user_data = response_buffer,
    };
    ESP_LOGI(TAG, "Downloading %s", request_addr);
    esp_http_client_handle_t client = esp_http_client_init(&config);
    esp_err_t err = esp_http_client_perform(client);

    if (err == ESP_OK) {
        ESP_LOGI(TAG, "Status = %d, content_length = %d",
                 esp_http_client_get_status_code(client),
                 esp_http_client_get_content_length(client));

        switch (esp_http_client_get_status_code(client)) {
            case 200:
                if (xGuiSemaphore != NULL && xSemaphoreTake(xGuiSemaphore, (TickType_t) 100) == pdTRUE) {
                    process_reprap_settings(response_buffer->buffer);
                    xSemaphoreGive(xGuiSemaphore);
                }
                break;
            case 401:
                ESP_LOGI(TAG, "Authorising with Duet");
                wifi_duet_authorise(response_buffer, false);
                break;
            default:
                break;
        }
    } else {
        ESP_LOGW(TAG, "Error requesting RepRap status: %s", esp_err_to_name(err));
    }
    esp_http_client_cleanup(client);
}

/**
 * Send GCode to the printer. Blocking call. Call from UI thread!
 * @param gcode_command
 */
bool reprap_send_gcode(char *gcode_command) {
    if (rp_conn_stat == REPPANEL_WIFI_CONNECTED) {
        if (reprap_wifi_send_gcode(gcode_command)) {
            add_console_hist_entry(gcode_command, CONSOLE_TYPE_REPPANEL);
            update_entries_ui();
            return true;
        }
    } else if (rp_conn_stat == REPPANEL_UART_CONNECTED) {
        reprap_uart_send_gcode(gcode_command);
        add_console_hist_entry(gcode_command, CONSOLE_TYPE_REPPANEL);
        update_entries_ui();
        return true;
    }
    return false;
}

/**
 * Launches a new thread that requests macros. Updates Macros list in GUI on success. Non blocking call.
 * @param folder_path e.g.
 */
void request_macros_async(char *folder_path) {
    if (rp_conn_stat == REPPANEL_WIFI_CONNECTED) {
        ESP_LOGW(TAG, "Requesting macros async not stable!");
        TaskHandle_t get_filelist_async_task_handle = NULL;
        xTaskCreate(reprap_wifi_get_filelist_task, "macros request task", 1024 * 5, folder_path,
                    tskIDLE_PRIORITY, &get_filelist_async_task_handle);
        configASSERT(get_filelist_async_task_handle);
    } else if (rp_conn_stat == REPPANEL_UART_CONNECTED) {
        request_macros(folder_path);
    }
}

