seeul8er/RepPanel_ESP32/main/reppanel_request.c
void request_macros(char *folder_path) {
    if (rp_conn_stat == REPPANEL_WIFI_CONNECTED) {
        ESP_LOGI(TAG, "Requesting macros");
        strncpy(request_file_path, folder_path, sizeof(request_file_path));  // buffer path to request
        duet_request_macros = true; // Set flag - processed by status update task
    } else if (rp_conn_stat == REPPANEL_UART_CONNECTED) {
        strncpy(request_file_path, folder_path, sizeof(request_file_path));  // buffer path to request
        duet_request_macros = true;
    }
}

/**
 * Updates internal global variables with file info
 * @param file_name Path to file name on printer local storage. NULL in case you need file info of currently printed file
 */
void request_fileinfo(char *file_name) {
    if (rp_conn_stat == REPPANEL_WIFI_CONNECTED) {
        ESP_LOGI(TAG, "Requesting file info");
        wifi_response_buff_t resp_buff_gui_task;
        reprap_wifi_get_fileinfo(&resp_buff_gui_task, file_name);
    } else if (rp_conn_stat == REPPANEL_UART_CONNECTED) {
        uart_request_file_info = true;
        if (file_name != NULL)
            strncpy(request_file_path, file_name, sizeof(request_file_path));
        else
            strcpy(request_file_path, "");
    }
}

/**
 * Launches a new thread that requests job list. Updates Job list in GUI on success. Non blocking call.
 */
void request_jobs_async(char *folder_path) {
    if (rp_conn_stat == REPPANEL_WIFI_CONNECTED) {
        ESP_LOGW(TAG, "Requesting jobs async not stable");
        TaskHandle_t get_filelist_async_task_handle = NULL;
        xTaskCreate(reprap_wifi_get_filelist_task, "jobs request task", 1024 * 5, folder_path,
                    tskIDLE_PRIORITY, &get_filelist_async_task_handle);
        configASSERT(get_filelist_async_task_handle);
    } else if (rp_conn_stat == REPPANEL_UART_CONNECTED) {
        request_jobs(folder_path);
    }
}

void request_jobs(char *folder_path) {
    if (rp_conn_stat == REPPANEL_WIFI_CONNECTED) {
        ESP_LOGI(TAG, "Requesting jobs");
        strncpy(request_file_path, folder_path, sizeof(request_file_path));  // buffer path to request
        duet_request_jobs = true; // Set flag - processed by status update task
    } else if (rp_conn_stat == REPPANEL_UART_CONNECTED) {
        strncpy(request_file_path, folder_path, sizeof(request_file_path));  // buffer path to request
        duet_request_jobs = true;   // set flag so task knows what to do in next iteration
    }
}

bool update_printer_addr() {
    ESP_LOGI(TAG, "Updating printer address");
    if (ends_with(rep_addr, ".local")) {
        char tmp_addr[strlen(rep_addr)];
        strcpy(tmp_addr, rep_addr);
        tmp_addr[strlen(tmp_addr) - 6] = '\0';
        memmove(tmp_addr, tmp_addr + 7, strlen(tmp_addr)); // cut off http://
        ESP_LOGI(TAG, "Resolving %s", tmp_addr);
        char tmp_res[32];
        if (resolve_mdns_host(tmp_addr, tmp_res)) {
            strcpy(rep_addr_resolved, tmp_res);
            return true;
        }
        return false;
    }
    return true;    // no resolving required. User entered IP directly
}

/**
 * Called every 750ms
 * @param task
 */
void request_reprap_status_updates(void *params) {
    TickType_t xLastWakeTime;
    const TickType_t xFrequency = (500 / portTICK_PERIOD_MS);
    xLastWakeTime = xTaskGetTickCount();
    int i = 0, b = 0;
    UBaseType_t uxHighWaterMark;
    uart_response_buff_t uart_receive_buff;
    wifi_response_buff_t resp_buff_status_update_task;
    while (strlen(rep_addr) < 1) {  // wait till request addr is set
        vTaskDelayUntil(&xLastWakeTime, xFrequency);
    }
    strncpy(rep_addr_resolved, rep_addr, 256);
    bool init_printer_addr_updated = false;
    while (1) {
        vTaskDelayUntil(&xLastWakeTime, xFrequency);
        if (rp_conn_stat == REPPANEL_UART_CONNECTED) {
            if (!got_duet_settings) {
                reprap_uart_download(&uart_receive_buff, "0:/sys/dwc2settings.json");   // get dummy values
            }
            if (!got_filaments) reprap_uart_get_filelist(&uart_receive_buff, "0:/filaments");
            if (uart_request_file_info) reprap_uart_get_file_info(&uart_receive_buff);
            if (duet_request_jobs) {
                reprap_uart_get_filelist(&uart_receive_buff, request_file_path);
                duet_request_jobs = false;
            }
            if (duet_request_macros) {
                reprap_uart_get_filelist(&uart_receive_buff, request_file_path);
                duet_request_macros = false;
            }
            if (!got_extended_status) reprap_uart_get_status(&uart_receive_buff, 3);
            if (!job_running)
                reprap_uart_get_status(&uart_receive_buff, 2);
            else
                reprap_uart_get_status(&uart_receive_buff, 4);
            if (i == 20) {
                reprap_uart_get_status(&uart_receive_buff, 3);
                i = 0;
            } else { i++; }
        } else if (rp_conn_stat == REPPANEL_WIFI_CONNECTED ||
                   rp_conn_stat == REPPANEL_WIFI_CONNECTED_DUET_DISCONNECTED) {
            if (init_printer_addr_updated) {
                if (!got_duet_settings)
                    reprap_wifi_download(&resp_buff_status_update_task, "0%3A%2Fsys%2Fdwc2settings.json");
                if (!got_filaments) reprap_wifi_get_filelist(&resp_buff_status_update_task, "0:/filaments&first=0");
                if (!got_extended_status) reprap_wifi_get_status(&resp_buff_status_update_task, 2);
                if (duet_request_reply) reprap_wifi_get_rreply(&resp_buff_status_update_task);
                // for synchron request of jobs
                if (duet_request_jobs) {
                    reprap_wifi_get_filelist(&resp_buff_status_update_task, request_file_path);
                    duet_request_jobs = false;
                }
                // for synchron request of macros
                if (duet_request_macros) {
                    reprap_wifi_get_filelist(&resp_buff_status_update_task, request_file_path);
                    duet_request_macros = false;
                }
                if (!job_running)
                    reprap_wifi_get_status(&resp_buff_status_update_task, 0);
                else
                    reprap_wifi_get_status(&resp_buff_status_update_task, 3);
                if (i == 20) {
                    reprap_wifi_get_status(&resp_buff_status_update_task, 2);

                    // Check if we got a UART connection
                    if (reppanel_is_uart_connected()) {
                        rp_conn_stat = REPPANEL_UART_CONNECTED;
                        memset(&resp_buff_status_update_task, 0, JSON_BUFF_SIZE);
                        if (xGuiSemaphore != NULL && xSemaphoreTake(xGuiSemaphore, (TickType_t) 10) == pdTRUE) {
                            update_rep_panel_conn_status();
                            xSemaphoreGive(xGuiSemaphore);
                        }
                    }
                    i = 0;
                } else { i++; }
                if (b == 20) {
                    update_printer_addr();  // in case addres has changed
                    b = 0;
                } else { b++; }
            } else {
                init_printer_addr_updated = update_printer_addr();  // initial resolving
            }
        } else {
            if (reppanel_is_uart_connected()) {
                rp_conn_stat = REPPANEL_UART_CONNECTED;
                memset(&resp_buff_status_update_task, 0, JSON_BUFF_SIZE);
                if (xGuiSemaphore != NULL && xSemaphoreTake(xGuiSemaphore, (TickType_t) 10) == pdTRUE) {
                    update_rep_panel_conn_status();
                    xSemaphoreGive(xGuiSemaphore);
                }
            }
        }
        uxHighWaterMark = uxTaskGetStackHighWaterMark(NULL);
        ESP_LOGD(TAG, "%i free bytes", uxHighWaterMark * 4);
    }
    vTaskDelete(NULL);
}
